{"pages":[{"url":"/como-contribuir-com-a-wiki","text":"Pensando na possibilidade de mantermos um site para a comunidade de maneira mais colaborativa onde qualquer um possa contribuir com conteúdo de maneira rápida, surgiu a idéia de utilizarmos o GitHub Pages. Este projeto utiliza Pelican como gerador de páginas estáticas e Travis-CI para realizar a integração contínua. Repo: https://github.com/itindublin/itindublin.github.io Vantagens Basta ter uma conta no GitHub Edição via internet Site sem senha e com versionamento Todos podem contribuir com o conteúdo do wiki Se vc nao tem conhecimento de git ou github apenas crie um issue você precisa apenas de uma conta do github para fazer isso. Criando uma Página na wiki Para criar uma página na wiki, você pode olhar o exemplo de uma página no diretório _content/pages/wiki_ . O seu arquivo deve ser criado nessa pasta. O Pelican suporta a linguagem de marcação ReStructured Text e Markdown . Uma página tem que ter obrigatóriamente um cabeçalho fixo, conforme abaixo (em ReST): Título da Sua Página ==================== Ou em Markdown: Title : Título da Sua Página Após esse cabeçalho você pode escrever de acordo com a linguagem de marcação escolhida. Importante Por padronização o nome do arquivo deve ser o título da página em caixa baixa separada por - ex: titulo-da-pagina Caso tenha dificuldades para escrever Markdown ou reStructuredText, veja esses editores online que auxiliam sua escrita: StackEdit Dillinger Prose","title":"Como contribuir com a Wiki","tags":"pages"},{"url":"/como-publicar-um-artigo","text":"Escrevendo um Artigo para o Blog Para escrever um artigo para o blog, é necessário apenas criar um arquivo no formato (.rst ou .md) que são linguagens de marcação aceitas pelo Pelican. Esse arquivo deve ser criado dentro do diretório content/articles Um artigo tem um cabeçalho fixo, conforme abaixo (em ReST): Título da Página ================ :date: 2015-07-22 14:57 :author: Nome do Autor :category: Tutoriais :tags: tutorial, tecnico, pelican, site :image: /images/monty-python-knights.jpg Ou em Markdown: Title : Título da Página Date : 2015 - 07 - 22 14 : 57 Author : Nome do Autor Category : Tutoriais Tags : tutorial , tecnico , pelican , site Image : /images/ monty - python - knights . jpg Novamente é tudo muito intuitivo, temos o título do artigo (a primeira linha em ReST, ou a precedida por Title: em Markdown) seguido da data de publicação (no formato YYYY-MM-DD HH:MM ). Logo abaixo temos o nome do autor, categoria e uma lista de tags. A Tag :image:: ou Image: (em Markdown) faz referência à imagem de capa do artigo, mas é opcional. Após esse cabeçalho você pode escrever de acordo com a linguagem de marcação escolhida. Referência: O Modelo deste site foi construido utilizando como referência o site do Grupy-df cuja o link encontra-se abaixo. http://df.python.org.br/blog/como-publicar-no-blog-do-grupy-df/","title":"Como publicar um artigo","tags":"pages"},{"url":"/duvidas-sobre-visto","text":"Duvida sobre visto de trabalho www.djei.ie Visto de estudante? Pode trabalhar? 20 ou 40 horas? http://www.citizensinformation.ie/en/travel_and_recreation/travel_to_ireland/student_visas.html","title":"Dúvidas sobre visto","tags":"wiki"},{"url":"/encontros","text":"Quando? Todo primeiro sábado do mês , as 18:00. Confira aqui nosso próximo encontro e confirme sua presença O Que acontece no encontro do Grupo IT In Dublin?? Há mais de um ano, nos reunimos todo primeiro sábado do mês para fazer um bate-papo de aproximadamente 1 hora e meia, cobrindo os tópicos abaixo, e então ficamos no pub para beber, comer e conversar! Recados Se souber de alguma notícia, mudança de regras de trabalho, imigração, ou evento interessante na área, por favor traga em uma folha de papel para colocar na parede e comentar com o resto do pessoal. Apresentação: JobSeekers e Calouros Se estiver procurando emprego na área de TI, e/ou for a primeira vez que comparece ao encontro, você poderá se apresentar caso queira. Bem informal mesmo, só pro pessoal saber de você e mais tarde conversar melhor. Divulgação de Vagas Se souber de vagas de emprego, POR FAVOR TRAGA IMPRESSA para colocar na parede. Inclua o telefone/email para contato em todas as folhas. Recrutadores são bem-vindos a trazerem vagas impressas também e aproveitarem para conhecer novos talentos! Networking Ao final desse bate papo, ficamos no Pub para comer, beber, conversar e nos conhecermos. Tão informal quanto produtivo! Confira eventos anteriores","title":"Encontros","tags":"pages"},{"url":"/eventos","text":"Página para a divulgação dos eventos da comunidade.","title":"Eventos","tags":"pages"},{"url":"/index","text":"","title":"IT In Dublin","tags":"pages"},{"url":"/lista-de-discussoes","text":"","title":"Lista de Discussões","tags":"pages"},{"url":"/membros","text":"","title":"Membros","tags":"pages"},{"url":"/regras-do-grupo","text":"Algumas Regras BÁSICAS! Grupo de discussão para profissionais Brasileiros de TI e áreas afins na Irlanda. O grupo não é uma lista de solicitação de empregos. Caso apareça alguma vaga, informaremos na lista. Antes de abrir uma thread, procure por posts anteriores para sua dúvida O grupo foi criado como uma extensão da lista de e-mail Google \"it-irlanda-br\" ... Procure e leia o histórico! Seja educado com as pessoas. Posts com conteúdo fora de TI serão deletados. Assuntos polêmicos como; \"A escola X é boa?\" ou \"e-dublin\" e outros serão moderados e ou deletados. Dai alguém aconselha um sujeito: - \"antes de ir pra Irlanda, acho que vc deveria pesquisar o mercado de trabalho de la\". Dai o que acontece?? Vem um cara do nada e pergunta no forum: - \"Como esta o mercado ae?\" ou \"O mercado esta aquecido por ae?\" Isso para vc eh pesquisa de mercado? A melhor resposta é; \"Na ultima vez que fui ao Tesco ele estava bem quentinho\"","title":"Regras do Grupo","tags":"wiki"},{"url":"/resultados","text":"","title":"Resultados","tags":"pages"},{"url":"/search","text":"","title":"search","tags":"pages"},{"url":"/tags-wiki","text":"","title":"Tags Wiki","tags":"pages"},{"url":"/wiki","text":"Wiki da comunidade Brasileira de TI na Irlanda Sobre Seja bem-vindo à wiki da comunidade brasileira de profissionais de IT na Irlanda. Esta é uma iniciativa coletiva com o intuito de compartilhar conhecimento e experiências sobre a área e o mercado. Se você trabalha (ou já trabalhou) com TI na Irlanda, provavelmente tem algo a acrescentar. Editores são encorajados a compartilhar conteúdo especialmente nos seguintes assuntos: Review de empresas Áreas de atuação Eventos recorrentes (eventos esporádicos podem ser divulgados no site de capa) Busca por emprego Visto de trabalho Documentação Abertura e regras para Start-ups E quaisquer outros temas que costumam gerar dúvidas. Contribuiçoes, gostaria de contribuir? Veja como e Fácil Criar página na Wiki Publicar Artigo Não possui conhecimento em desenvolvimento? ou github? sem problema apenas crie um issue clique no link e contribua issue você pode adicionar fontes, imagens arquivo o que desejar. Contato Para entrar em contato com outros colaboradores, visite: slack: https://itindublin.herokuapp.com/ google forum: https://groups.google.com/forum/#!forum/it-irlanda-br facebook page: https://www.facebook.com/groups/ITinDublin/","title":"Páginas da Wiki","tags":"pages"},{"url":"/blog/primeiro-artigo","text":"teste","title":"Primeiro Artigo","tags":"Teste"}]}