{"pages":[{"url":"/como-contribuir-com-a-wiki","text":"Pensando na possibilidade de mantermos um site para a comunidade de maneira mais colaborativa onde qualquer um possa contribuir com conteúdo de maneira rápida, surgiu a idéia de utilizarmos o GitHub Pages. Este projeto utiliza Pelican como gerador de páginas estáticas e Travis-CI para realizar a integração contínua. Repo: https://github.com/itindublin/itindublin.github.io Vantagens Basta ter uma conta no GitHub Edição via internet Site sem senha e com versionamento Todos podem contribuir com o conteúdo do wiki Se vc nao tem conhecimento de git ou github apenas crie um issue você precisa apenas de uma conta do github para fazer isso. Criando uma Página na wiki Para criar uma página na wiki, você pode olhar o exemplo de uma página no diretório _content/pages/wiki_ . O seu arquivo deve ser criado nessa pasta. O Pelican suporta a linguagem de marcação ReStructured Text e Markdown . Uma página tem que ter obrigatóriamente um cabeçalho fixo, conforme abaixo (em ReST): Título da Sua Página ==================== Ou em Markdown: Title : T í tulo da Sua P á gina Após esse cabeçalho você pode escrever de acordo com a linguagem de marcação escolhida. Importante Por padronização o nome do arquivo deve ser o título da página em caixa baixa separada por - ex: titulo-da-pagina Caso tenha dificuldades para escrever Markdown ou reStructuredText, veja esses editores online que auxiliam sua escrita: StackEdit Dillinger Prose","tags":"pages","title":"Como contribuir com a Wiki"},{"url":"/como-publicar-um-artigo","text":"Escrevendo um Artigo para o Blog Para escrever um artigo para o blog, é necessário apenas criar um arquivo no formato (.rst ou .md) que são linguagens de marcação aceitas pelo Pelican. Esse arquivo deve ser criado dentro do diretório content/articles Um artigo tem um cabeçalho fixo, conforme abaixo (em ReST): Título da Página ================ :date: 2015-07-22 14:57 :author: Nome do Autor :category: Tutoriais :tags: tutorial, tecnico, pelican, site :image: /images/monty-python-knights.jpg Ou em Markdown: Title : T í tulo da P á gina Date : 2015 - 07 - 22 14 : 57 Author : Nome do Autor Category : Tutoriais Tags : tutorial , tecnico , pelican , site Image : /images/ monty - python - knights . jpg Novamente é tudo muito intuitivo, temos o título do artigo (a primeira linha em ReST, ou a precedida por Title: em Markdown) seguido da data de publicação (no formato YYYY-MM-DD HH:MM ). Logo abaixo temos o nome do autor, categoria e uma lista de tags. A Tag :image:: ou Image: (em Markdown) faz referência à imagem de capa do artigo, mas é opcional. Após esse cabeçalho você pode escrever de acordo com a linguagem de marcação escolhida. Referência: O Modelo deste site foi construido utilizando como referência o site do Grupy-df cuja o link encontra-se abaixo. http://df.python.org.br/blog/como-publicar-no-blog-do-grupy-df/","tags":"pages","title":"Como publicar um artigo"},{"url":"/comunidade","text":"","tags":"pages","title":"Comunidade"},{"url":"/duvidas-sobre-visto","text":"Duvida sobre visto de trabalho www.djei.ie Visto de estudante? Pode trabalhar? 20 ou 40 horas? http://www.citizensinformation.ie/en/travel_and_recreation/travel_to_ireland/student_visas.html","tags":"wiki","title":"Dúvidas sobre visto"},{"url":"/eventos","text":"Página para a divulgação dos eventos da comunidade.","tags":"pages","title":"Eventos"},{"url":"/index","text":"","tags":"pages","title":"IT In Dublin"},{"url":"/lista-de-discussoes","text":"","tags":"pages","title":"Lista de Discussões"},{"url":"/membros","text":"","tags":"pages","title":"Membros"},{"url":"/regras-do-grupo","text":"Algumas Regras BÁSICAS! Grupo de discussão para profissionais Brasileiros de TI e áreas afins na Irlanda. O grupo não é uma lista de solicitação de empregos. Caso apareça alguma vaga, informaremos na lista. Antes de abrir uma thread, procure por posts anteriores para sua dúvida O grupo foi criado como uma extensão da lista de e-mail Google \"it-irlanda-br\" ... Procure e leia o histórico! Seja educado com as pessoas. Posts com conteúdo fora de TI serão deletados. Assuntos polêmicos como; \"A escola X é boa?\" ou \"e-dublin\" e outros serão moderados e ou deletados. Dai alguém aconselha um sujeito: - \"antes de ir pra Irlanda, acho que vc deveria pesquisar o mercado de trabalho de la\". Dai o que acontece?? Vem um cara do nada e pergunta no forum: - \"Como esta o mercado ae?\" ou \"O mercado esta aquecido por ae?\" Isso para vc eh pesquisa de mercado? A melhor resposta é; \"Na ultima vez que fui ao Tesco ele estava bem quentinho\"","tags":"wiki","title":"Regras do Grupo"},{"url":"/search","text":"","tags":"pages","title":"search"},{"url":"/wiki","text":"","tags":"pages","title":"Páginas da Wiki"},{"url":"/blog/primeiro-artigo","text":"teste","tags":"Teste","title":"Primeiro Artigo"}]}